Revit 2027 API
ParameterTypeId.BoundaryLinearRestraintX Property
 "X Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryLinearRestraintX { get; }
Public Shared ReadOnly Property BoundaryLinearRestraintX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryLinearRestraintX {
	ForgeTypeId^ get ();
}
static member BoundaryLinearRestraintX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace